lianggongkai/stm32tofx2n/Project/FX2N/Ladder.c
/********************************************************/
// CPU??:STM32F103--RAM?????64K	Flash?????128K
// ?????STM32F103RDT6????
// ????:20150903
// editor by DaShi
/********************************************************/
// 20150905 :ADD command: INC  INCP  DEC  DECP	FLT
/********************************************************/


#include "stm32f10x.h"
#include "OS_Config.h"
#include <stdio.h>
#include <absacc.h> 
#define on 0xff
#define off 0x00
extern u16 all_data[];
extern u8 p_all_data[];
extern const u16  x[0x6800];
extern u8  step_status[];
extern u8  Run_Flag; 	//ADD	   
extern void timer_enable(u16 timer_number);	 
extern void timer_disble(u16 timer_number);	 
extern void backup_data(void);
static u16 *p_data,process_value;
static const u16 *p_prog;
static u8 T_number,C_number;
static u16 T_value,C_value;
static u16 mov_d_value;
static u16 mov_d_addr;
u16 C_count[2];
static const u16 *program_start_addr;
static const u16 *prog_p_addr[129];	
static const u16 *p_save[129];      
u16 process[64];                    
u16 sub_add1,sub_add2;
u8 edit_prog;

u8 find_step(u16 addr)    
{ static u16 temp1,temp2;
	temp1=addr/0x08;
	temp2=addr%0x08;
	temp2=(1<<temp2);
	if((step_status[temp1]&temp2)==temp2)
		return on;
	else		
		return off;
}
void set_step(u16 addr)    
{ static u16 temp1,temp2;
	temp1=addr/0x08;
	temp2=addr%0x08;
	temp2=(1<<temp2);
	step_status[temp1]|=temp2;
}
void reset_step(u16 addr)    
{ static u16 temp1,temp2;
	static u8 temp4;
	temp1=addr/0x08;
	temp2=addr%0x08;
	temp2=(1<<temp2);
	temp4=~temp2;
	step_status[temp1]&=temp4;
}
static void LD(u16 start_addr,u8 process_addr)	
{u16 temp2;
	p_data=all_data+start_addr+process_addr/0x10;   
	temp2=process_addr%0x10;
	if((*p_data&(1<<temp2))==(1<<temp2)) 
		process_value<<=1,process_value|=1;
	else
		process_value<<=1,process_value&=~1;
}
static u8 LDF(u16 start_addr,u8 process_addr)	  
{u16 temp2;
	p_data=all_data+start_addr+process_addr/0x10;   
	temp2=process_addr%0x10;
	if((*p_data&(1<<temp2))==(1<<temp2)) 
		return on;
	else
		return off;
}
static void LDI(u16 start_addr,u8 process_addr)
{u16 temp2;
	p_data=all_data+start_addr+process_addr/0x10;   
	temp2=process_addr%0x10;
	if((*p_data&(1<<temp2))==(1<<temp2)) 
		process_value<<=1,process_value&=-1;
	else
		process_value<<=1,process_value|=1;
}
void AND(u16 start_addr,u8 process_addr)
{u16 temp2;
	p_data=all_data+start_addr+process_addr/0x10;   
	temp2=process_addr%0x10;
	if(((*p_data&(1<<temp2))==(1<<temp2))&&((process_value&0X01)==0X01)) 
		process_value|=0X01;
	else
		process_value&=~0X01; 
}
static void ANI(u16 start_addr,u8 process_addr)
{u16 temp2;
	p_data=all_data+start_addr+process_addr/0x10;   
	temp2=process_addr%0x10;
	if((!((*p_data&(1<<temp2))==(1<<temp2)))&&((process_value&0X01)==0X01)) 
		process_value|=0X01;
	else
		process_value&=~0X01; 
}
static void OR(u16 start_addr,u8 process_addr)
{u16 temp2;
	p_data=all_data+start_addr+process_addr/0x10;   
	temp2=process_addr%0x10;
	if(((*p_data&(1<<temp2))==(1<<temp2))||((process_value&0X01)==0X01)) 
		process_value|=0X01;
	else
		process_value&=~0X01; 
}
static void ORI(u16 start_addr,u8 process_addr)
{u16 temp2;
	p_data=all_data+start_addr+process_addr/0x10;   
	temp2=process_addr%0x10;
	if((!((*p_data&(1<<temp2))==(1<<temp2)))||((process_value&0X01)==0X01)) 
		process_value|=0X01;
	else
		process_value&=~0X01; 
}
static void OUT(u16 start_addr,u8 process_addr)
{u16 temp2;
	p_data=all_data+start_addr+process_addr/0x10;   
	temp2=process_addr%0x10;
	if((process_value&0X01)==0X01)
		*p_data|=(1<<temp2);
	else
		*p_data&=~(1<<temp2); 
}
void force_set(u16 start_addr,u8 process_addr)  
{u16 temp2;
	p_data=all_data+start_addr+process_addr/0x10;   
	temp2=process_addr%0x10;
	*p_data|=(1<<temp2);
}
static void BIT_SET(u16 start_addr,u8 process_addr)	
{u16 temp2;
	p_data=all_data+start_addr+process_addr/0x10;   
	temp2=process_addr%0x10;
	if((process_value&0X01)==0X01)
		*p_data|=(1<<temp2);
}
void force_reset(u16 start_addr,u8 process_addr) 
{u16 temp2;
	p_data=all_data+start_addr+process_addr/0x10;   
	temp2=process_addr%0x10;
	*p_data&=~(1<<temp2);
}		 
static void RST(u16 start_addr,u8 process_addr)	
{u16 temp2;
	p_data=all_data+start_addr+process_addr/0x10;   
	temp2=process_addr%0x10;
	if((process_value&0X01)==0X01)
		*p_data&=~(1<<temp2);
}
static void MPS(void)				      
{process_value<<=1;
	if((process_value&0x02)==0x02)
		process_value|=0x01;
	else
		process_value&=~0x01;
}
static void MRD(void)					
{
	if((process_value&0x02)==0x02)
		process_value|=0x01;
	else
		process_value&=~0x01;
}


static void ORB(void)				  
{u16 temp;
	temp=process_value;
	process_value>>=1;
	if(((process_value&0x01)==0x01)||((temp&0X01)==0X01))
		process_value|=0x01;
	else
		process_value&=~0x01;
}
static void ANB(void)				   
{u16 temp;
	temp=process_value;
	process_value>>=1;
	if(((process_value&0x01)==0x01)&&((temp&0X01)==0X01))
		process_value|=0x01;
	else
		process_value&=~0x01;
}
static void INV(void)				   
{
	if((process_value&0x01)==0x00)	
		process_value|=0x01;
	else
		process_value&=~0x01;
}
	static void other_function(u8 process_addr)
{switch(process_addr)
	{ 
		case 0xF8:   ANB()               ;	 break;    //??? ANB
		case 0xF9:   ORB()               ;	 break;    //??? ORB
		case 0xFA:   MPS()               ;  break;    //??   MPS
		case 0xFB:   MRD()               ;  break;	   //??   MRD
		case 0xFD:   INV()               ;  break;    //??   INV
		case 0xFF: 					    break;	  //ADD
		default:  ;                       break;	
	}
}
static void extend_LD_M(void)   
{ 
	switch(*p_prog/0x100)
	{case 0xA8: LD(0X0060,*p_prog),p_prog++;             break;  
		case 0xA9: LD(0X0070,*p_prog),p_prog++;             break;  
		case 0xAA: LD(0X0080,*p_prog),p_prog++;             break;  
		case 0xAB: LD(0X0090,*p_prog),p_prog++;             break;  
		case 0xAC: LD(0X00A0,*p_prog),p_prog++;             break;  
		case 0xAD: LD(0X00B0,*p_prog),p_prog++;             break;  
	}
}
static void extend_LDI_M(void)   
{ 
	switch(*p_prog/0x100)
	{case 0xA8: LDI(0X0060,*p_prog),p_prog++;             break;  
		case 0xA9: LDI(0X0070,*p_prog),p_prog++;             break;  
		case 0xAA: LDI(0X0080,*p_prog),p_prog++;             break;  
		case 0xAB: LDI(0X0090,*p_prog),p_prog++;             break;  
		case 0xAC: LDI(0X00A0,*p_prog),p_prog++;             break;  
		case 0xAD: LDI(0X00B0,*p_prog),p_prog++;             break;  
	}
}
static void extend_OR_M(void)   
{ 
	switch(*p_prog/0x100)
	{case 0xA8: OR(0X0060,*p_prog),p_prog++;             break;  
		case 0xA9: OR(0X0070,*p_prog),p_prog++;             break;  
		case 0xAA: OR(0X0080,*p_prog),p_prog++;             break;  
		case 0xAB: OR(0X0090,*p_prog),p_prog++;             break;  
		case 0xAC: OR(0X00A0,*p_prog),p_prog++;             break;  
		case 0xAD: OR(0X00B0,*p_prog),p_prog++;             break;  
	}
}
static void extend_ORI_M(void)   
{ 
	switch(*p_prog/0x100)
	{case 0xA8: ORI(0X0060,*p_prog),p_prog++;             break;  
		case 0xA9: ORI(0X0070,*p_prog),p_prog++;             break;  
		case 0xAA: ORI(0X0080,*p_prog),p_prog++;             break;  
		case 0xAB: ORI(0X0090,*p_prog),p_prog++;             break;  
		case 0xAC: ORI(0X00A0,*p_prog),p_prog++;             break;  
		case 0xAD: ORI(0X00B0,*p_prog),p_prog++;             break;  
	}
}
static void extend_AND_M(void)   
{ 
	switch(*p_prog/0x100)
	{case 0xA8: AND(0X0060,*p_prog),p_prog++;             break;  
		case 0xA9: AND(0X0070,*p_prog),p_prog++;             break;  
		case 0xAA: AND(0X0080,*p_prog),p_prog++;             break;  
		case 0xAB: AND(0X0090,*p_prog),p_prog++;             break;  
		case 0xAC: AND(0X00A0,*p_prog),p_prog++;             break;  
		case 0xAD: AND(0X00B0,*p_prog),p_prog++;             break;  
	}
}
static void extend_ANI_M(void)   
{ 
	switch(*p_prog/0x100)
	{case 0xA8: ANI(0X0060,*p_prog),p_prog++;             break;  
		case 0xA9: ANI(0X0070,*p_prog),p_prog++;             break;  
		case 0xAA: ANI(0X0080,*p_prog),p_prog++;             break;  
		case 0xAB: ANI(0X0090,*p_prog),p_prog++;             break;  
		case 0xAC: ANI(0X00A0,*p_prog),p_prog++;             break;  
		case 0xAD: ANI(0X00B0,*p_prog),p_prog++;             break;  
	}
}

static void extend_SET_M(void)   
{ 
	switch(*p_prog/0x100)
	{case 0xA8: BIT_SET(0X0060,*p_prog),p_prog++;             break;  
		case 0xA9: BIT_SET(0X0070,*p_prog),p_prog++;             break;  
		case 0xAA: BIT_SET(0X0080,*p_prog),p_prog++;             break;  
		case 0xAB: BIT_SET(0X0090,*p_prog),p_prog++;             break;  
		case 0xAC: BIT_SET(0X00A0,*p_prog),p_prog++;             break;  
		case 0xAD: BIT_SET(0X00B0,*p_prog),p_prog++;             break;  
	}
}
static void extend_RST_M(void)   
{ 
	switch(*p_prog/0x100)
	{case 0xA8: RST(0X0060,*p_prog),p_prog++;             break;  
		case 0xA9: RST(0X0070,*p_prog),p_prog++;             break;  
		case 0xAA: RST(0X0080,*p_prog),p_prog++;             break;  
		case 0xAB: RST(0X0090,*p_prog),p_prog++;             break;  
		case 0xAC: RST(0X00A0,*p_prog),p_prog++;             break;  
		case 0xAD: RST(0X00B0,*p_prog),p_prog++;             break;  
	}
}
static void extend_OUT_M(void)   
{ 
	switch(*p_prog/0x100)
	{case 0xA8: OUT(0X0060,*p_prog),p_prog++;             break;  
		case 0xA9: OUT(0X0070,*p_prog),p_prog++;             break;  
		case 0xAA: OUT(0X0080,*p_prog),p_prog++;             break;  
		case 0xAB: OUT(0X0090,*p_prog),p_prog++;             break;  
		case 0xAC: OUT(0X00A0,*p_prog),p_prog++;             break;  
		case 0xAD: OUT(0X00B0,*p_prog),p_prog++;             break;  
	}
}
static void extend_SET_S(void)   
{ 
	switch(*p_prog/0x100)
	{case 0x80: BIT_SET(0X0140,*p_prog),p_prog++;             break;  
		case 0x81: BIT_SET(0X0150,*p_prog),p_prog++;             break;  
		case 0x82: BIT_SET(0X0160,*p_prog),p_prog++;             break;  
		case 0x83: BIT_SET(0X0170,*p_prog),p_prog++;             break;  
	}
}
static void extend_RST_S(void)   
{ 
	switch(*p_prog/0x100)
	{case 0x80: RST(0X0140,*p_prog),p_prog++;             break;  
		case 0x81: RST(0X0150,*p_prog),p_prog++;             break;  
		case 0x82: RST(0X0160,*p_prog),p_prog++;             break;  
		case 0x83: RST(0X0170,*p_prog),p_prog++;             break;  
	}
}
static void extend_OUT_S(void)   
{ 
	switch(*p_prog/0x100)
	{case 0x80: OUT(0X0140,*p_prog),p_prog++;             break;  
		case 0x81: OUT(0X0150,*p_prog),p_prog++;             break;  
		case 0x82: OUT(0X0160,*p_prog),p_prog++;             break;  
		case 0x83: OUT(0X0170,*p_prog),p_prog++;             break;  
	}
}
	static void RESET_T(u8 process_addr) 		
{ if((process_value&0x01)==0x01) 			
	{
		timer_disble(process_addr);
	}
	OUT(0X0380,*p_prog);
}
	static void RESET_C(u8 process_addr) 	   
{ if((process_value&0x01)==0x01) 		   
	{ p_data=all_data+0x0500+process_addr;  
		*p_data=0;							   
		p_data=all_data+0x00F0+(process_addr/0x10); 
		*p_data&=~(1<<process_addr%0x10);	   
	}
	OUT(0X0370,*p_prog);
}
static void extend_RST_T(void)             
{  
	switch(*p_prog/0x100)
	{case 0x86: RESET_T(*p_prog),p_prog++;            break;  
		case 0x8E: RESET_C(*p_prog),p_prog++;            break;  
	}
}

static void MOV_TO_K_H(void)	   
{  
	static u8 LL_BIT;      
	static u16 JOB_ADDR;
	static u32 MOV_DATA_16BIT,MOV_DATA_16BIT_BACKUP,MOV_DATA_BACKUP1;  

	LL_BIT=mov_d_addr%0x10;						 
	JOB_ADDR=mov_d_addr/0x10;					 

