lianggongkai/stm32tofx2n/Project/FX2N/Ladder.c
	switch(*p_prog/0x100)							 

	{case 0x82: MOV_DATA_16BIT_BACKUP=mov_d_value&0X000F,MOV_DATA_16BIT_BACKUP<<=LL_BIT,MOV_DATA_BACKUP1=~(0X000F<<LL_BIT); break;
		case 0x84: MOV_DATA_16BIT_BACKUP=mov_d_value&0X00FF,MOV_DATA_16BIT_BACKUP<<=LL_BIT,MOV_DATA_BACKUP1=~(0X00FF<<LL_BIT); break;
		case 0x86: MOV_DATA_16BIT_BACKUP=mov_d_value&0X0FFF,MOV_DATA_16BIT_BACKUP<<=LL_BIT,MOV_DATA_BACKUP1=~(0X0FFF<<LL_BIT); break;
		case 0x88: MOV_DATA_16BIT_BACKUP=mov_d_value       ,MOV_DATA_16BIT_BACKUP<<=LL_BIT,MOV_DATA_BACKUP1=~(0XFFFF<<LL_BIT); break;
		default:     p_prog+=3;                           break;  
	}

	switch(*p_prog%0x100)

	{case 0x00: MOV_DATA_16BIT=all_data[0x0140+JOB_ADDR]+(all_data[0x0141+JOB_ADDR])*0X10000,

		MOV_DATA_16BIT&=MOV_DATA_BACKUP1,MOV_DATA_16BIT|=MOV_DATA_16BIT_BACKUP,

		all_data[0x0140+JOB_ADDR]=MOV_DATA_16BIT,all_data[0x0141+JOB_ADDR]=MOV_DATA_16BIT/0X10000; break;
		case 0x01: MOV_DATA_16BIT=all_data[0x0150+JOB_ADDR]+(all_data[0x0151+JOB_ADDR])*0X10000,
			   MOV_DATA_16BIT&=MOV_DATA_BACKUP1,MOV_DATA_16BIT|=MOV_DATA_16BIT_BACKUP,
				   all_data[0x0150+JOB_ADDR]=MOV_DATA_16BIT,all_data[0x0151+JOB_ADDR]=MOV_DATA_16BIT/0X10000; break;
		case 0x02: MOV_DATA_16BIT=all_data[0x0160+JOB_ADDR]+(all_data[0x0161+JOB_ADDR])*0X10000,
			   MOV_DATA_16BIT&=MOV_DATA_BACKUP1,MOV_DATA_16BIT|=MOV_DATA_16BIT_BACKUP,
				   all_data[0x0160+JOB_ADDR]=MOV_DATA_16BIT,all_data[0x0161+JOB_ADDR]=MOV_DATA_16BIT/0X10000; break;
		case 0x03: MOV_DATA_16BIT=all_data[0x0170+JOB_ADDR]+(all_data[0x0171+JOB_ADDR])*0X10000,
			   MOV_DATA_16BIT&=MOV_DATA_BACKUP1,MOV_DATA_16BIT|=MOV_DATA_16BIT_BACKUP,
				   all_data[0x0170+JOB_ADDR]=MOV_DATA_16BIT,all_data[0x0171+JOB_ADDR]=MOV_DATA_16BIT/0X10000; break;

		case 0x04: MOV_DATA_16BIT=all_data[0x0120+JOB_ADDR]+(all_data[0x0121+JOB_ADDR])*0X10000,
			   MOV_DATA_16BIT&=MOV_DATA_BACKUP1,MOV_DATA_16BIT|=MOV_DATA_16BIT_BACKUP,
				   all_data[0x0120+JOB_ADDR]=MOV_DATA_16BIT,all_data[0x0121+JOB_ADDR]=MOV_DATA_16BIT/0X10000; break;
		case 0x05: MOV_DATA_16BIT=all_data[0x00C0+JOB_ADDR]+(all_data[0x00C1+JOB_ADDR])*0X10000,
			   MOV_DATA_16BIT&=MOV_DATA_BACKUP1,MOV_DATA_16BIT|=MOV_DATA_16BIT_BACKUP,
				   all_data[0x00C0+JOB_ADDR]=MOV_DATA_16BIT,all_data[0x00C1+JOB_ADDR]=MOV_DATA_16BIT/0X10000; break;

		case 0x08: MOV_DATA_16BIT=all_data[0x0000+JOB_ADDR]+(all_data[0x0001+JOB_ADDR])*0X10000,
			   MOV_DATA_16BIT&=MOV_DATA_BACKUP1,MOV_DATA_16BIT|=MOV_DATA_16BIT_BACKUP,
				   all_data[0x0000+JOB_ADDR]=MOV_DATA_16BIT,all_data[0x0001+JOB_ADDR]=MOV_DATA_16BIT/0X10000; break;
		case 0x09: MOV_DATA_16BIT=all_data[0x0010+JOB_ADDR]+(all_data[0x0011+JOB_ADDR])*0X10000,
			   MOV_DATA_16BIT&=MOV_DATA_BACKUP1,MOV_DATA_16BIT|=MOV_DATA_16BIT_BACKUP,
				   all_data[0x0010+JOB_ADDR]=MOV_DATA_16BIT,all_data[0x0011+JOB_ADDR]=MOV_DATA_16BIT/0X10000; break;
		case 0x0A: MOV_DATA_16BIT=all_data[0x0020+JOB_ADDR]+(all_data[0x0021+JOB_ADDR])*0X10000,
			   MOV_DATA_16BIT&=MOV_DATA_BACKUP1,MOV_DATA_16BIT|=MOV_DATA_16BIT_BACKUP,
				   all_data[0x0020+JOB_ADDR]=MOV_DATA_16BIT,all_data[0x0021+JOB_ADDR]=MOV_DATA_16BIT/0X10000; break;
		case 0x0B: MOV_DATA_16BIT=all_data[0x0030+JOB_ADDR]+(all_data[0x0031+JOB_ADDR])*0X10000,
			   MOV_DATA_16BIT&=MOV_DATA_BACKUP1,MOV_DATA_16BIT|=MOV_DATA_16BIT_BACKUP,
				   all_data[0x0030+JOB_ADDR]=MOV_DATA_16BIT,all_data[0x0031+JOB_ADDR]=MOV_DATA_16BIT/0X10000; break;
		case 0x0C: MOV_DATA_16BIT=all_data[0x0040+JOB_ADDR]+(all_data[0x0041+JOB_ADDR])*0X10000,
			   MOV_DATA_16BIT&=MOV_DATA_BACKUP1,MOV_DATA_16BIT|=MOV_DATA_16BIT_BACKUP,
				   all_data[0x0040+JOB_ADDR]=MOV_DATA_16BIT,all_data[0x0041+JOB_ADDR]=MOV_DATA_16BIT/0X10000; break;
		case 0x0D: MOV_DATA_16BIT=all_data[0x0050+JOB_ADDR]+(all_data[0x0051+JOB_ADDR])*0X10000,
			   MOV_DATA_16BIT&=MOV_DATA_BACKUP1,MOV_DATA_16BIT|=MOV_DATA_16BIT_BACKUP,
				   all_data[0x0050+JOB_ADDR]=MOV_DATA_16BIT,all_data[0x0051+JOB_ADDR]=MOV_DATA_16BIT/0X10000; break;

		case 0x28: MOV_DATA_16BIT=all_data[0x0060+JOB_ADDR]+(all_data[0x0061+JOB_ADDR])*0X10000,
			   MOV_DATA_16BIT&=MOV_DATA_BACKUP1,MOV_DATA_16BIT|=MOV_DATA_16BIT_BACKUP,
				   all_data[0x0060+JOB_ADDR]=MOV_DATA_16BIT,all_data[0x0061+JOB_ADDR]=MOV_DATA_16BIT/0X10000; break;
		case 0x29: MOV_DATA_16BIT=all_data[0x0070+JOB_ADDR]+(all_data[0x0071+JOB_ADDR])*0X10000,
			   MOV_DATA_16BIT&=MOV_DATA_BACKUP1,MOV_DATA_16BIT|=MOV_DATA_16BIT_BACKUP,
				   all_data[0x0070+JOB_ADDR]=MOV_DATA_16BIT,all_data[0x0071+JOB_ADDR]=MOV_DATA_16BIT/0X10000; break;
		case 0x2A: MOV_DATA_16BIT=all_data[0x0080+JOB_ADDR]+(all_data[0x0081+JOB_ADDR])*0X10000,
			   MOV_DATA_16BIT&=MOV_DATA_BACKUP1,MOV_DATA_16BIT|=MOV_DATA_16BIT_BACKUP,
				   all_data[0x0080+JOB_ADDR]=MOV_DATA_16BIT,all_data[0x0081+JOB_ADDR]=MOV_DATA_16BIT/0X10000; break;
		case 0x2B: MOV_DATA_16BIT=all_data[0x0090+JOB_ADDR]+(all_data[0x0091+JOB_ADDR])*0X10000,
			   MOV_DATA_16BIT&=MOV_DATA_BACKUP1,MOV_DATA_16BIT|=MOV_DATA_16BIT_BACKUP,
				   all_data[0x0090+JOB_ADDR]=MOV_DATA_16BIT,all_data[0x0091+JOB_ADDR]=MOV_DATA_16BIT/0X10000; break;
		case 0x2C: MOV_DATA_16BIT=all_data[0x00A0+JOB_ADDR]+(all_data[0x00A1+JOB_ADDR])*0X10000,
			   MOV_DATA_16BIT&=MOV_DATA_BACKUP1,MOV_DATA_16BIT|=MOV_DATA_16BIT_BACKUP,
				   all_data[0x00A0+JOB_ADDR]=MOV_DATA_16BIT,all_data[0x00A1+JOB_ADDR]=MOV_DATA_16BIT/0X10000; break;
		case 0x2D: MOV_DATA_16BIT=all_data[0x00B0+JOB_ADDR]+(all_data[0x00B1+JOB_ADDR])*0X10000,
			   MOV_DATA_16BIT&=MOV_DATA_BACKUP1,MOV_DATA_16BIT|=MOV_DATA_16BIT_BACKUP,
				   all_data[0x00B0+JOB_ADDR]=MOV_DATA_16BIT,all_data[0x00B1+JOB_ADDR]=MOV_DATA_16BIT/0X10000; break;


		default:     p_prog++;                           break;  
	}
	p_prog++;	
}
static void MOV_K(void)	  
{static u8 LL_BIT;      
	static u32 MOV_DATA_16BIT;   

	LL_BIT=mov_d_value%0x10;						 

	switch(*p_prog%0x100)
	{case 0x00: MOV_DATA_16BIT=all_data[0x0140+mov_d_value/0x10]+(all_data[0x0141+mov_d_value/0x10])*0X10000,
		MOV_DATA_16BIT>>=LL_BIT,mov_d_value=MOV_DATA_16BIT; break;
		case 0x01: MOV_DATA_16BIT=all_data[0x0150+mov_d_value/0x10]+(all_data[0x0151+mov_d_value/0x10])*0X10000,
			   MOV_DATA_16BIT>>=LL_BIT,mov_d_value=MOV_DATA_16BIT; break;
		case 0x02: MOV_DATA_16BIT=all_data[0x0160+mov_d_value/0x10]+(all_data[0x0161+mov_d_value/0x10])*0X10000,
			   MOV_DATA_16BIT>>=LL_BIT,mov_d_value=MOV_DATA_16BIT; break;
		case 0x03: MOV_DATA_16BIT=all_data[0x0170+mov_d_value/0x10]+(all_data[0x0171+mov_d_value/0x10])*0X10000,
			   MOV_DATA_16BIT>>=LL_BIT,mov_d_value=MOV_DATA_16BIT; break;

		case 0x04: MOV_DATA_16BIT=all_data[0x0120+mov_d_value/0x10]+(all_data[0x0121+mov_d_value/0x10])*0X10000,
			   MOV_DATA_16BIT>>=LL_BIT,mov_d_value=MOV_DATA_16BIT; break;
		case 0x05: MOV_DATA_16BIT=all_data[0x00C0+mov_d_value/0x10]+(all_data[0x00C1+mov_d_value/0x10])*0X10000,
			   MOV_DATA_16BIT>>=LL_BIT,mov_d_value=MOV_DATA_16BIT; break;

		case 0x08: MOV_DATA_16BIT=all_data[0x0000+mov_d_value/0x10]+(all_data[0x0001+mov_d_value/0x10])*0X10000,
			   MOV_DATA_16BIT>>=LL_BIT,mov_d_value=MOV_DATA_16BIT; break;
		case 0x09: MOV_DATA_16BIT=all_data[0x0010+mov_d_value/0x10]+(all_data[0x0011+mov_d_value/0x10])*0X10000,
			   MOV_DATA_16BIT>>=LL_BIT,mov_d_value=MOV_DATA_16BIT; break;
		case 0x0A: MOV_DATA_16BIT=all_data[0x0020+mov_d_value/0x10]+(all_data[0x0021+mov_d_value/0x10])*0X10000,
			   MOV_DATA_16BIT>>=LL_BIT,mov_d_value=MOV_DATA_16BIT; break;
		case 0x0B: MOV_DATA_16BIT=all_data[0x0030+mov_d_value/0x10]+(all_data[0x0031+mov_d_value/0x10])*0X10000,
			   MOV_DATA_16BIT>>=LL_BIT,mov_d_value=MOV_DATA_16BIT; break;
		case 0x0C: MOV_DATA_16BIT=all_data[0x0040+mov_d_value/0x10]+(all_data[0x0041+mov_d_value/0x10])*0X10000,
			   MOV_DATA_16BIT>>=LL_BIT,mov_d_value=MOV_DATA_16BIT; break;
		case 0x0D: MOV_DATA_16BIT=all_data[0x0050+mov_d_value/0x10]+(all_data[0x0051+mov_d_value/0x10])*0X10000,
			   MOV_DATA_16BIT>>=LL_BIT,mov_d_value=MOV_DATA_16BIT; break;

		case 0x28: MOV_DATA_16BIT=all_data[0x0060+mov_d_value/0x10]+(all_data[0x0061+mov_d_value/0x10])*0X10000,
			   MOV_DATA_16BIT>>=LL_BIT,mov_d_value=MOV_DATA_16BIT; break;
		case 0x29: MOV_DATA_16BIT=all_data[0x0070+mov_d_value/0x10]+(all_data[0x0071+mov_d_value/0x10])*0X10000,
			   MOV_DATA_16BIT>>=LL_BIT,mov_d_value=MOV_DATA_16BIT; break;
		case 0x2A: MOV_DATA_16BIT=all_data[0x0080+mov_d_value/0x10]+(all_data[0x0081+mov_d_value/0x10])*0X10000,
			   MOV_DATA_16BIT>>=LL_BIT,mov_d_value=MOV_DATA_16BIT; break;
		case 0x2B: MOV_DATA_16BIT=all_data[0x0090+mov_d_value/0x10]+(all_data[0x0091+mov_d_value/0x10])*0X10000,
			   MOV_DATA_16BIT>>=LL_BIT,mov_d_value=MOV_DATA_16BIT; break;
		case 0x2C: MOV_DATA_16BIT=all_data[0x00A0+mov_d_value/0x10]+(all_data[0x00A1+mov_d_value/0x10])*0X10000,
			   MOV_DATA_16BIT>>=LL_BIT,mov_d_value=MOV_DATA_16BIT; break;
		case 0x2D: MOV_DATA_16BIT=all_data[0x00B0+mov_d_value/0x10]+(all_data[0x00B1+mov_d_value/0x10])*0X10000,
			   MOV_DATA_16BIT>>=LL_BIT,mov_d_value=MOV_DATA_16BIT; break;

