lianggongkai/stm32tofx2n/Project/FX2N/Ladder.c
		default:     p_prog+=2;                           break;  
	}
}

static void K_M_MOV_D_H(void)	   
{							 

	switch(*p_prog/0x100)
	{case 0x82: MOV_K(),mov_d_value&=0X000F; break;
		case 0x84: MOV_K(),mov_d_value&=0X00FF; break;
		case 0x86: MOV_K(),mov_d_value&=0X0FFF; break;
		case 0x88: MOV_K()                   ; break;
		default:     p_prog+=3;                           break;  
	}
}
static u16 h_cos_value(u16 l_value)
{static u16 temp; 
	switch(*p_prog/0x100)
	{case 0x80: temp=l_value+((*p_prog%0x100)*0x100),p_prog++; break;                             
		case 0x82: temp=l_value+((*p_prog%0x100)*0x100),temp=all_data[0x0800+temp/2],p_prog++; break;
		case 0x84: temp=l_value+((*p_prog%0x100)*0x100),temp=all_data[0x0500+temp/2],p_prog++; break;
		case 0x86: temp=l_value+((*p_prog%0x100)*0x100),temp=all_data[0x2000+temp/2],p_prog++; break;
		case 0x88: temp=l_value+((*p_prog%0x100)*0x100),temp=all_data[0x2000+temp/2+1000],p_prog++; break;
	}
	return temp;
}
static u16  cos_value(void)	   
{static u16 temp; 
	switch(*p_prog/0x100)
	{case 0x80: temp=*p_prog%0x100,p_prog++,temp=h_cos_value(temp); break;
		case 0x82: temp=*p_prog%0x100,p_prog++,temp=h_cos_value(temp); break;
		case 0x84: mov_d_value=*p_prog%0x100,p_prog++,K_M_MOV_D_H(),temp=mov_d_value,p_prog++;  break;	
		case 0x86: temp=*p_prog%0x100,p_prog++,temp=h_cos_value(temp); break;
		case 0x88: temp=*p_prog%0x100,p_prog++,temp=h_cos_value(temp); break;
	}
	return temp;
}
static void add_assgin_value(u16 assgin_value) 
{static u16 temp; 
	switch(*p_prog/0x100)
	{
		case 0x82: temp=assgin_value+((*p_prog%0x100)*0x100),all_data[0x0800+temp/2]=sub_add1,p_prog++; break;
		case 0x84: temp=assgin_value+((*p_prog%0x100)*0x100),all_data[0x0500+temp/2]=sub_add1,p_prog++; break;
		case 0x86: temp=assgin_value+((*p_prog%0x100)*0x100),all_data[0x2000+temp/2]=sub_add1,p_prog++; break;
		case 0x88: temp=assgin_value+((*p_prog%0x100)*0x100),all_data[0x2000+temp/2+1000]=sub_add1,p_prog++; break;
	}
} 
static void add_target(void)	
{ u16 temp;
	switch(*p_prog/0x100)
	{case 0x82: temp=*p_prog%0x100,p_prog++,add_assgin_value(temp); break;

		case 0x84: mov_d_addr=*p_prog%0x100,p_prog++,mov_d_value=sub_add1,MOV_TO_K_H(); break;	         
		case 0x86: temp=*p_prog%0x100,p_prog++,add_assgin_value(temp); break;
		case 0x88: temp=*p_prog%0x100,p_prog++,add_assgin_value(temp); break;
	}
}
static void div_assign_value(u16 l_value) 
{static u16 temp; 
	switch(*p_prog/0x100)
	{
		case 0x82: temp=l_value+((*p_prog%0x100)*0x100),all_data[0x0800+temp/2]=sub_add1,all_data[0x0801+temp/2]=sub_add2,p_prog++; break;
		case 0x84: temp=l_value+((*p_prog%0x100)*0x100),all_data[0x0500+temp/2]=sub_add1,all_data[0x0501+temp/2]=sub_add2,p_prog++; break;
		case 0x86: temp=l_value+((*p_prog%0x100)*0x100),all_data[0x2000+temp/2]=sub_add1,all_data[0x2001+temp/2]=sub_add2,p_prog++; break;
		case 0x88: temp=l_value+((*p_prog%0x100)*0x100),all_data[0x2000+temp/2+1000]=sub_add1,all_data[0x2000+temp/2+1001]=sub_add2,p_prog++; break;
	}
}

static void mul_target(void)									
{ u16 temp;
	switch(*p_prog/0x100)
	{case 0x82: temp=*p_prog%0x100,p_prog++,div_assign_value(temp); break;

		case 0x84: mov_d_addr=*p_prog%0x100,p_prog++,mov_d_value=sub_add1,MOV_TO_K_H(); break;	         
		case 0x86: temp=*p_prog%0x100,p_prog++,div_assign_value(temp); break;
		case 0x88: temp=*p_prog%0x100,p_prog++,div_assign_value(temp); break;
	}
}
static void extend_MOV(void)	   
{
	if((process_value&0X01)==0X01)  
		sub_add1=cos_value(),add_target();  
	else
		p_prog+=4;		          
}
static void extend_MOVP(void)	  
{ u8  logic_1; 

	logic_1=find_step(p_prog-program_start_addr);  
	if(logic_1==off)							   
	{ if((process_value&0x01)==0x01)					   
		{ set_step(p_prog-program_start_addr);
			sub_add1=cos_value(),add_target(); 
		}
		else
			p_prog+=4;		  
	}
	else
	{if(!((process_value&0x01)==0x01))						 
		reset_step(p_prog-program_start_addr);		 
		p_prog+=4;		  
	} 
}
static void add(void)	   
{ signed short int temp1,temp2;
	if((process_value&0X01)==0X01)
	{temp1=cos_value();
		temp2=cos_value();
		sub_add1=temp1+temp2;
		add_target();
	}
}

static void INC(void)	   	 //ADD TKZSLD
{
	if((process_value&0X01)==0X01)
	{
		sub_add1=cos_value();
		p_prog-=2;
		sub_add1++;
		add_target();
	}
	else
		p_prog+=2;
}


static void extend_INCP(void)	  
{ u8  logic_1; 

	logic_1=find_step(p_prog-program_start_addr);  
	if(logic_1==off)							   
	{ if((process_value&0x01)==0x01)					   
		{ set_step(p_prog-program_start_addr);
			INC();  
		}
		else
			p_prog+=2;		  
	}
	else
	{if(!((process_value&0x01)==0x01))						 
		reset_step(p_prog-program_start_addr);		 
		p_prog+=2;		  
	} 
}

static void DEC(void)	   	 //ADD TKZSLD	//???? ?1??
{
	if((process_value&0X01)==0X01)
	{
		sub_add1=cos_value();
		p_prog-=2;
		sub_add1--;
		add_target();
	}
	else
		p_prog+=2;	    //??2???
}

static void extend_DECP(void)	  
{ u8  logic_1; 

	logic_1=find_step(p_prog-program_start_addr);  
	if(logic_1==off)							   
	{ if((process_value&0x01)==0x01)					   
		{ set_step(p_prog-program_start_addr);
			DEC();  
		}
		else
			p_prog+=2;		  
	}
	else
	{if(!((process_value&0x01)==0x01))						 
		reset_step(p_prog-program_start_addr);		 
		p_prog+=2;		  
	} 
}


static void extend_ADDP(void)	  
{ u8  logic_1; 

	logic_1=find_step(p_prog-program_start_addr);  
	if(logic_1==off)							   
	{ if((process_value&0x01)==0x01)					   
		{ set_step(p_prog-program_start_addr);
			add();  
		}
		else
			p_prog+=4;		  
	}
	else
	{if(!((process_value&0x01)==0x01))						 
		reset_step(p_prog-program_start_addr);		 
		p_prog+=4;		  
	} 
}
static void sub(void)	   
{ signed short int temp1,temp2;
	if((process_value&0X01)==0X01)
	{temp1=cos_value();
		temp2=cos_value();
		sub_add1=temp1-temp2;
		add_target();
	}
}
static void extend_SUBP(void)	  
{ u8  logic_1; 

	logic_1=find_step(p_prog-program_start_addr);  
	if(logic_1==off)							   
	{ if((process_value&0x01)==0x01)					   
		{ set_step(p_prog-program_start_addr);
			sub();  
		}
		else
			p_prog+=4;		  
	}
	else
	{if(!((process_value&0x01)==0x01))						 
		reset_step(p_prog-program_start_addr);		 
		p_prog+=4;		  
	} 
}
static void mul(void)	 
{ signed int temp1,temp2;
	if((process_value&0X01)==0X01)
	{
		temp1=cos_value();
		temp2=cos_value();
		sub_add1=(temp1*temp2)%0x10000;
		sub_add2=(temp1*temp2)/0x10000;
		mul_target();
	}
}
static void extend_MULP(void)	  
{ u8  logic_1; 

	logic_1=find_step(p_prog-program_start_addr);  
	if(logic_1==off)							   
	{ if((process_value&0x01)==0x01)					   
		{ set_step(p_prog-program_start_addr);
			mul();  
		}
		else
			p_prog+=4;		  
	}
	else
	{if(!((process_value&0x01)==0x01))						 
		reset_step(p_prog-program_start_addr);		 
		p_prog+=4;		  
	} 
}
static void div(void)	 
{ signed short int temp1,temp2;
	if((process_value&0X01)==0X01)
	{
		temp1=cos_value();
		temp2=cos_value();
		sub_add1=temp1/temp2;
		sub_add2=temp1%temp2;
		mul_target();
	}
}
static void extend_DIVP(void)	  
{ u8  logic_1; 

	logic_1=find_step(p_prog-program_start_addr);  
	if(logic_1==off)							   
	{ if((process_value&0x01)==0x01)					   
		{ set_step(p_prog-program_start_addr);
			div();  
		}
		else
			p_prog+=4;		  
	}
	else
	{if(!((process_value&0x01)==0x01))						 
		reset_step(p_prog-program_start_addr);		 
		p_prog+=4;		  
	} 
}

static void amount(void)	 
{ signed short int temp1,temp2;
	temp1=cos_value();
	temp2=cos_value();
	if(temp1==temp2) 
		process_value<<=1,process_value|=1;
	else
		process_value<<=1,process_value&=~1;
}



static void big(void)		
{ signed short int temp1,temp2;
	temp1=cos_value();
	temp2=cos_value();
	if(temp1>temp2) 
		process_value<<=1,process_value|=1;
	else
		process_value<<=1,process_value&=~1;
}


