lianggongkai/stm32tofx2n/Project/FX2N/Ladder.c
static void less(void)	   
{ signed short int temp1,temp2;
	temp1=cos_value();
	temp2=cos_value();
	if(temp1<temp2) 
		process_value<<=1,process_value|=1;
	else
		process_value<<=1,process_value&=~1;
}



static void less_amount(void)	   
{ signed short int temp1,temp2;
	temp1=cos_value();
	temp2=cos_value();
	if(temp1>temp2) 
		process_value<<=1,process_value|=1;
	else
		process_value<<=1,process_value&=~1;
}



static void big_amount(void)	   
{ signed short int temp1,temp2;
	temp1=cos_value();
	temp2=cos_value();
	if(temp1<temp2) 
		process_value<<=1,process_value|=1;
	else
		process_value<<=1,process_value&=~1;
}

static void amount_and(void)	 
{ signed short int temp1,temp2;
	temp1=cos_value();
	temp2=cos_value();
	if((temp1==temp2)&&((process_value&0X01)==0X01)) 
		process_value|=1;
	else
		process_value&=~1;
}

static void big_and(void)		
{ signed short int temp1,temp2;
	temp1=cos_value();
	temp2=cos_value();
	if((temp1>temp2)&&((process_value&0X01)==0X01)) 
		process_value|=1;
	else
		process_value&=~1;
}

static void less_and(void)	   
{ signed short int temp1,temp2;
	temp1=cos_value();
	temp2=cos_value();
	if((temp1<temp2)&&((process_value&0X01)==0X01)) 
		process_value|=1;
	else
		process_value&=~1;
}

static void less_amount_and(void)	   
{ signed short int temp1,temp2;
	temp1=cos_value();
	temp2=cos_value();
	if((temp1>temp2)&&((process_value&0X01)==0X01)) 
		process_value|=1;
	else
		process_value&=~1;
}

static void big_amount_and(void)	   
{ signed short int temp1,temp2;
	temp1=cos_value();
	temp2=cos_value();
	if((temp1<temp2)&&((process_value&0X01)==0X01)) 
		process_value|=1;
	else
		process_value&=~1;
}



static u8 bit_value(void)	 
{ u8  temp;
	switch(*p_prog/0X100)
	{ case 0x80: temp=LDF(0X0140,*p_prog); break;  
		case 0x81: temp=LDF(0X0150,*p_prog); break;  
		case 0x82: temp=LDF(0X0160,*p_prog); break;  
		case 0x83: temp=LDF(0X0170,*p_prog); break;  
		case 0x84: temp=LDF(0X0120,*p_prog); break;  
		case 0x85: temp=LDF(0X00C0,*p_prog); break;  
		case 0x86: temp=LDF(0X0100,*p_prog); break;  

		case 0x88: temp=LDF(0X0000,*p_prog); break;  
		case 0x89: temp=LDF(0X0010,*p_prog); break;  
		case 0x8A: temp=LDF(0X0020,*p_prog); break;  
		case 0x8B: temp=LDF(0X0030,*p_prog); break;  
		case 0x8C: temp=LDF(0X0040,*p_prog); break;  
		case 0x8D: temp=LDF(0X0050,*p_prog); break;  
		case 0x8E: temp=LDF(0X00F0,*p_prog); break;  
		case 0x8F: temp=LDF(0X00E0,*p_prog); break;  

		case 0xA8: temp=LDF(0X0060,*p_prog); break;  
		case 0xA9: temp=LDF(0X0070,*p_prog); break;  
		case 0xAA: temp=LDF(0X0080,*p_prog); break;  
		case 0xAB: temp=LDF(0X0090,*p_prog); break;  
		case 0xAC: temp=LDF(0X00A0,*p_prog); break;  
		case 0xAD: temp=LDF(0X00B0,*p_prog); break;  

		default:  temp=2   ;                       break;  
	}
	return temp;
}
static void extend_LDP(void)	  
{ u8  logic_1,logic_2;

	logic_1=find_step(p_prog-program_start_addr);	 
	logic_2=bit_value();							 
	if(logic_1==off)							   
	{ if(logic_2==on)							   
		process_value<<=1,process_value|=1,set_step(p_prog-program_start_addr);
		else
			process_value<<=1,process_value&=~1;;		 
	}
	else
	{if(logic_2==on)							   
		process_value<<=1,process_value&=~1;
		else
			process_value<<=1,process_value&=~1,reset_step(p_prog-program_start_addr);		 
	}  
	p_prog++;	    
}

static void extend_LDF(void)	 
{ u8  logic_3,logic_4;

	logic_3=find_step(p_prog-program_start_addr);	 
	logic_4=bit_value();				  		 
	if(logic_3==on)							   
	{ if(logic_4==off)						   
		process_value<<=1,process_value|=1,reset_step(p_prog-program_start_addr);
		else
			process_value<<=1,process_value&=~1;		 
	}
	else
	{if(logic_4==off)							   
		process_value<<=1,process_value&=~1;
		else
			process_value<<=1,process_value&=~1,set_step(p_prog-program_start_addr);		 
	}  
	p_prog++;
}
static void extend_ANDP(void)	 
{ u8  logic_1,logic_2;

	logic_1=find_step(p_prog-program_start_addr);	 
	logic_2=bit_value();
	if(logic_1==off)							   
	{ if(logic_2==on)							   
		logic_2=1,set_step(p_prog-program_start_addr);
		else
			logic_2=0;		 
	}
	else
	{if(logic_2==on)							   
		logic_2=0;
		else
			logic_2=0,reset_step(p_prog-program_start_addr); 
	}  
	if(((process_value&0x01)==0x01)&&(logic_2==1))
		process_value|=1;
	else
		process_value&=~1;
	p_prog++;	    
}

static void extend_ANDF(void)	 
{ u8  logic_3,logic_4;

	logic_3=find_step(p_prog-program_start_addr);	 
	logic_4=bit_value();
	if(logic_3==on)							   
	{ if(logic_4==off)						   
		logic_4=1,reset_step(p_prog-program_start_addr);
		else
			logic_4=0;		 
	}
	else
	{if(logic_4==off)							   
		logic_4=0;
		else
			logic_4=0,set_step(p_prog-program_start_addr);		 
	}  
	if(((process_value&0x01)==0x01)&&(logic_4==1))
		process_value|=1;
	else
		process_value&=~1;
	p_prog++;
}
static void extend_ORP(void)	 
{ u8  logic_1,logic_2;

	logic_1=find_step(p_prog-program_start_addr);	 
	logic_2=bit_value();
	if(logic_1==off)							   
	{ if(logic_2==on)							   
		logic_2=1,set_step(p_prog-program_start_addr);
		else
			logic_2=0;		 
	}
	else
	{if(logic_2==on)							   
		logic_2=0;
		else
			logic_2=0,reset_step(p_prog-program_start_addr);		 
	}  
	if(((process_value&0x01)==0x01)||(logic_2==1))
		process_value|=1;
	else
		process_value&=~1;
	p_prog++;	    
}

static void extend_ORF(void)	 
{ u8  logic_3,logic_4;

	logic_3=find_step(p_prog-program_start_addr);	 
	logic_4=bit_value();
	if(logic_3==on)							   
	{ if(logic_4==off)						   
		logic_4=1,reset_step(p_prog-program_start_addr);
		else
			logic_4=0;		 
	}
	else
	{if(logic_4==off)							   
		logic_4=0;
		else
			logic_4=0,set_step(p_prog-program_start_addr);	
	}  
	if(((process_value&0x01)==0x01)||(logic_4==1))
		process_value|=1;
	else
		process_value&=~1;
	p_prog++;
}
static void CJ_EX(u16 value)  
{ 
	p_prog++;
	switch(*p_prog/0X100)
	{ case 0x80: p_prog=prog_p_addr[value/2],p_prog++;   break;  
		default:               break;
	}
}
static void CJ(void)
{ 
	if((process_value&0X01)==0X01)
	{switch(*p_prog/0X100)
		{ case 0x88: CJ_EX(*p_prog%0X100);   break;  
		}
	}
}
static void RET(void)
{ u8 temp;
	process_value=process[0];	
	p_prog=p_save[0];	  	    
	for(temp=62;temp>0;temp--)
	{process[temp]=process[temp+1];    
		p_save[temp]=p_save[temp+1]; 
	}
}
static void P_MOV(void)
{ u8 temp;
	for(temp=62;temp>0;temp--)
	{process[temp+1]=process[temp];    
		p_save[temp+1]=p_save[temp]; 
	}
	process[0]=process_value;	
	p_save[0]=p_prog;				
}
static void CALL_EX(u16 value)
{ 
	p_prog++;
	switch(*p_prog/0X100)
	{ case 0x80: P_MOV(),p_prog=prog_p_addr[value/2];   break;  
	}
}
static void CALL(void)
{ 
	if((process_value&0X01)==0X01)
	{ switch(*p_prog/0X100)
		{ case 0x88: CALL_EX(*p_prog%0X100),p_prog++;   break;  
		}
	}
}
	static void extend_function(void) 
{ switch(*p_prog) 
	{case 0x0002: p_prog++,extend_OUT_M();            break;  
		case 0x0003: p_prog++,extend_SET_M();            break;  
		case 0x0004: p_prog++,extend_RST_M();            break;  

		case 0x0005: p_prog++,extend_OUT_S();            break;  
		case 0x0006: p_prog++,extend_SET_S();            break;  
		case 0x0007: p_prog++,extend_RST_S();            break;  

		case 0x000C: p_prog++,extend_RST_T();            break;  
		case 0X0038: p_prog++,add();					  break; 
		case 0x0040: p_prog++,INC();                     break;  //ADD BY TKZSLD 
		case 0x0042: p_prog++,DEC();                     break;  //ADD BY TKZSLD
		case 0X003A: p_prog++,sub();					  break;  
		case 0x003C: p_prog++,mul();                     break;  
		case 0x003E: p_prog++,div();                     break;  

		case 0x0010: p_prog++,CJ();                      break;  
		case 0x0012: p_prog++,CALL();                    break;  


		case 0x01C2: p_prog++,extend_LD_M();             break;  
		case 0x01C3: p_prog++,extend_LDI_M();            break;  
		case 0x01C4: p_prog++,extend_AND_M();            break;  
		case 0x01C5: p_prog++,extend_ANI_M();            break;  
		case 0x01C6: p_prog++,extend_OR_M();             break;  
		case 0x01C7: p_prog++,extend_ORI_M();            break;  

		case 0x01CA: p_prog++,extend_LDP();			  break;  
		case 0x01CB: p_prog++,extend_LDF();			  break;  
		case 0x01CC: p_prog++,extend_ANDP();			  break;  
		case 0x01CD: p_prog++,extend_ANDF();			  break;  
		case 0x01CE: p_prog++,extend_ORP();			  break;  
		case 0x01CF: p_prog++,extend_ORF();			  break;  

		case 0x0028: p_prog++,extend_MOV();		      break;  

		case 0x000f: p_prog=p_prog;                      break;  

