lianggongkai/stm32tofx2n/Project/FX2N/Ladder.c
		case 0X01D0: p_prog++,amount();                  break;  
		case 0X01D2: p_prog++,big();                     break;  
		case 0X01D4: p_prog++,less();                    break; 
		case 0X01DA: p_prog++,less_amount();             break;  
		case 0X01DC: p_prog++,big_amount();              break;  
		case 0X1028: p_prog++,extend_MOVP();             break;  
		case 0X1038: p_prog++,extend_ADDP();             break;  
		case 0X103A: p_prog++,extend_SUBP();             break;  
		case 0X103C: p_prog++,extend_MULP();             break;  
		case 0X103E: p_prog++,extend_DIVP();             break;  

		case 0x1040: p_prog++,extend_INCP();              break;  //16?????????1??  tkzsld
		case 0x1042: p_prog++,extend_DECP();              break;  //16?????????1??	tkzsld

		case 0X01E0: p_prog++,amount_and();                  break;  
		case 0X01E2: p_prog++,big_and();                     break;  
		case 0X01E4: p_prog++,less_and();                    break; 
		case 0X01EA: p_prog++,less_amount_and();             break;  
		case 0X01EC: p_prog++,big_amount_and();              break;  



		case 0XF7FF: p_prog++,RET();                     break;  

		default:     p_prog++;                           break;  
	}
}
static void enable_T_K(void)
{T_value=*p_prog%0x100;   
	p_prog++;
	T_value+=(*p_prog%0x100)*0x100;  
	p_data=all_data+0x1000+T_number; 
	*p_data=T_value;       
	timer_enable(T_number);
	OUT(0X280,T_number);
}
static void enable_T_D(void)
{p_data=all_data+0x1000+T_number;
	*p_data=all_data[0x2000+T_value];
	timer_enable(T_number);
	OUT(0X280,T_number);
}
static void disable_T(void)
{
	timer_disble(T_number);
	OUT(0X0280,T_number);	 
	OUT(0x0100,T_number);	 
}
static void T_given_value_K(void)	      
{
	if((process_value&0X01)==0X01)  
		enable_T_K();
	else
		disable_T(); 
}
static void T_given_value_D(void)	      
{ T_value=(*p_prog%0x100)/2;
	p_prog++;
	switch(*p_prog/0x100) 
	{ case 0x86: T_value+=(*p_prog%0x100)*0x80;   break;
		case 0x88: T_value+=(*p_prog%0x100)*0x80+1000;   break; 
	}
	if((process_value&0X01)==0X01)  
		enable_T_D();
	else
		disable_T();
}
static void operation_T(void)
{T_number=*p_prog;       
	p_prog++;				  
	switch(*p_prog/0x100) 
	{ case 0x80: T_given_value_K(),p_prog++;              break;  
		case 0x86: T_given_value_D(),p_prog++;              break;  
	}	
}
static void enable_C_K(void)	   
{u16 temp_bit,*p_C_enable_coil;
	C_value=*p_prog%0x100;           
	p_prog++;
	C_value+=(*p_prog%0x100)*0x100;  
	p_data=all_data+0x0500+C_number;
	temp_bit=1<<(C_number%0x10);
	if(*p_data<C_value)              
	{p_C_enable_coil=all_data+0x0270+(C_number/0X10);   
		if(!((*p_C_enable_coil&temp_bit)==temp_bit))
			*p_data+=1;
	}
	if(*p_data<C_value)  
	{ p_data=all_data+0x00F0+(C_number/0x10);  
		*p_data&=~(1<<(C_number%0x10));
	}
	else
	{  p_data=all_data+0x00F0+(C_number/0x10);  
		*p_data|=(1<<(C_number%0x10));
	}
	OUT(0X270,C_number);
}
static void enable_C_D(void)	  
{u16 temp_bit,*p_C_enable_coil;
	C_value=all_data[0x2000+C_value];
	p_data=all_data+0x0500+C_number;
	temp_bit=1<<(C_number%0x10);
	if(*p_data<C_value)    
	{ p_C_enable_coil=all_data+0x0270+(C_number/0X10);   
		if(!((*p_C_enable_coil&temp_bit)==temp_bit))
			*p_data+=1;
	}
	p_C_enable_coil=all_data+0x00F0+(C_number/0x10);  
	if(*p_data<C_value)  
		*p_C_enable_coil&=~temp_bit;
	else
		*p_C_enable_coil|=temp_bit;
	OUT(0X270,C_number);
}
static void disable_C_K(void)
{
	C_value=*p_prog%0x100;           
	p_prog++;
	C_value+=(*p_prog%0x100)*0x100;  
	p_data=all_data+0x0500+C_number;
	if(*p_data<C_value)  
	{ p_data=all_data+0x00F0+(C_number/0x10);  
		*p_data&=~(1<<(C_number%0x10));
	}
	else
	{  p_data=all_data+0x00F0+(C_number/0x10);  
		*p_data|=(1<<(C_number%0x10));
	}
	OUT(0X270,C_number);
}
static void disable_C_D(void)	   
{u16 temp_bit,*p_C_enable_coil;
	C_value=all_data[0x2000+C_value];
	p_data=all_data+0x0500+C_number;
	temp_bit=1<<(C_number%0x10);
	p_C_enable_coil=all_data+0x00F0+(C_number/0x10);  
	if(*p_data<C_value)  
		*p_C_enable_coil&=~temp_bit;
	else
		*p_C_enable_coil|=temp_bit;

	OUT(0X270,C_number);
}

static void C_given_value_K(void)	      
{
	if((process_value&0X01)==0X01)          
		enable_C_K();				   
	else
		disable_C_K(); 
}
static void C_given_value_D(void)	      
{ C_value=(*p_prog%0x100)/2;
	p_prog++;
	switch(*p_prog/0x100) 
	{ case 0x86: C_value+=(*p_prog%0x100)*0x80;        break;
		case 0x88: C_value+=(*p_prog%0x100)*0x80+1000;   break; 
	}
	if((process_value&0X01)==0X01)        
		enable_C_D();
	else
		disable_C_D();
}
static void operation_C(void)
{C_number=*p_prog;       
	p_prog++;				  
	switch(*p_prog/0x100) 
	{ case 0x80: C_given_value_K(),p_prog++;              break;  
		case 0x86: C_given_value_D(),p_prog++;              break;  
	}	
}
void find_p(void)   
{ u16 temp;
	p_prog=x+0x5c/2-1;
	for(temp=0;temp<7999;temp++)	   
	{ if((*p_prog/0x100)==0xB0)
		prog_p_addr[*p_prog%0x100]=p_prog;
		p_prog++;
	}
}
void RST_Y(void)
{ static u8 all_out_rst;
	if(all_out_rst>10)
		all_out_rst=0;
	if(p_all_data[0X01C4]==0x09)
		all_out_rst=0;
	else
	{	if(all_out_rst==0)
		all_out_rst++,all_data[0x180/2]=0;
	}
}
u8 find_toend(void)   
{ u16 temp;
	p_prog=x+0x5c/2-2;
	temp=0;	
	do
	{ p_prog++;
		temp++;
	}while((!(*p_prog==0x000f))&&(temp<7998)); 
	if(temp>7997)
		return 1;
	else		  
		return 0;
}

void all_prog_process(void)		 //20151009
{ 
	u8  temp5,run_keep;
	static u8  puls;
	program_start_addr=x+0x5c/2-1;     
	run_keep=p_all_data[0X01C4];   
	RST_Y(); 


	if(1/*RUN_STOP==0*/)	  //MY PCB== 0	 AIR=1
	{
		if(Run_Flag==1)	 //RUN_STOP
		{
			Run_Flag = 0;
			run_keep=0x09;
		}


		if(run_keep==0x09)			  
		{
			Run=0;
			force_set(0X00E0,0);	 
			force_reset(0X00E0,1);	
			if(edit_prog==0x00)		 
			{ 
				find_p(),edit_prog=1;
				if(find_toend())
				{  
					p_all_data[0X01C4]=9;
					goto all_end;  
				}
			}
			if(puls==0x00)		 
				force_set(0X00E0,2),force_reset(0X00E0,3);
			p_prog=x+0x5c/2-1;
			all_data[0x070C]=20;        
			do
			{
				temp5=*p_prog/0x100;
				switch(temp5) 
				{ 
					case 0x06: operation_T();                           break;  
					case 0x0E: operation_C();                           break;  

					case 0x20: LD(0X0140,*p_prog),p_prog++;             break;  
					case 0x30: LDI(0X0140,*p_prog),p_prog++;            break;  
					case 0x40: AND(0X0140,*p_prog),p_prog++;            break;  
					case 0x50: ANI(0X0140,*p_prog),p_prog++;            break;  
					case 0x60: OR(0X0140,*p_prog),p_prog++;             break;  
					case 0x70: ORI(0X0140,*p_prog),p_prog++;            break;  

					case 0x21: LD(0X0150,*p_prog),p_prog++;             break;  
					case 0x31: LDI(0X0150,*p_prog),p_prog++;            break;  
					case 0x41: AND(0X0150,*p_prog),p_prog++;            break;  
					case 0x51: ANI(0X0150,*p_prog),p_prog++;            break;  
					case 0x61: OR(0X0150,*p_prog),p_prog++;             break;  
					case 0x71: ORI(0X0150,*p_prog),p_prog++;            break;  

					case 0x22: LD(0X0160,*p_prog),p_prog++;             break;  
					case 0x32: LDI(0X0160,*p_prog),p_prog++;            break;  
					case 0x42: AND(0X0160,*p_prog),p_prog++;            break;  
					case 0x52: ANI(0X0160,*p_prog),p_prog++;            break;  
					case 0x62: OR(0X0160,*p_prog),p_prog++;             break;  
					case 0x72: ORI(0X0160,*p_prog),p_prog++;            break;  

					case 0x23: LD(0X0170,*p_prog),p_prog++;             break;  
					case 0x33: LDI(0X0170,*p_prog),p_prog++;            break;  
					case 0x43: AND(0X0170,*p_prog),p_prog++;            break;  
					case 0x53: ANI(0X0170,*p_prog),p_prog++;            break;  
					case 0x63: OR(0X0170,*p_prog),p_prog++;             break;  
					case 0x73: ORI(0X0170,*p_prog),p_prog++;            break;  


					case 0x24: LD(0X0120,*p_prog),p_prog++;             break;  
					case 0x34: LDI(0X0120,*p_prog),p_prog++;            break;  
					case 0x44: AND(0X0120,*p_prog),p_prog++;            break;  
					case 0x54: ANI(0X0120,*p_prog),p_prog++;            break;  
					case 0x64: OR(0X0120,*p_prog),p_prog++;             break;  
					case 0x74: ORI(0X0120,*p_prog),p_prog++;            break;  

