lianggongkai/stm32tofx2n/Project/FX2N/Ladder.c
					case 0x25: LD(0X00C0,*p_prog),p_prog++;             break;  
					case 0x35: LDI(0X00C0,*p_prog),p_prog++;            break;  
					case 0x45: AND(0X00C0,*p_prog),p_prog++;            break;
					case 0x55: ANI(0X00C0,*p_prog),p_prog++;            break;
					case 0x65: OR(0X00C0,*p_prog),p_prog++;             break;  
					case 0x75: ORI(0X00C0,*p_prog),p_prog++;            break;  
					case 0XC5: OUT(0X00C0,*p_prog),p_prog++;			break;  
					case 0XD5: BIT_SET(0X00C0,*p_prog),p_prog++;	    break;  
					case 0XE5: RST(0X00C0,*p_prog),p_prog++;			break;  

					case 0x26: LD(0X0100,*p_prog),p_prog++;             break;  
					case 0x36: LDI(0X0100,*p_prog),p_prog++;            break;  
					case 0x46: AND(0X0100,*p_prog),p_prog++;            break;
					case 0x56: ANI(0X0100,*p_prog),p_prog++;            break;
					case 0x66: OR(0X0100,*p_prog),p_prog++;             break;  
					case 0x76: ORI(0X0100,*p_prog),p_prog++;            break;  
					case 0XC6: OUT(0X0100,*p_prog),p_prog++;			break;  

					case 0x28: LD(0X0000,*p_prog),p_prog++;             break;  
					case 0x38: LDI(0X0000,*p_prog),p_prog++;            break;  
					case 0x48: AND(0X0000,*p_prog),p_prog++;            break;
					case 0x58: ANI(0X0000,*p_prog),p_prog++;            break;
					case 0x68: OR(0X0000,*p_prog),p_prog++;             break;  
					case 0x78: ORI(0X0000,*p_prog),p_prog++;            break;  
					case 0XC8: OUT(0X0000,*p_prog),p_prog++;			break;  
					case 0XD8: BIT_SET(0X0000,*p_prog),p_prog++;	    break;  
					case 0XE8: RST(0X0000,*p_prog),p_prog++;			break;  

					case 0x29: LD(0X0010,*p_prog),p_prog++;             break;  
					case 0x39: LDI(0X0010,*p_prog),p_prog++;            break;  
					case 0x49: AND(0X0010,*p_prog),p_prog++;            break;
					case 0x59: ANI(0X0010,*p_prog),p_prog++;            break;
					case 0x69: OR(0X0010,*p_prog),p_prog++;             break;  
					case 0x79: ORI(0X0010,*p_prog),p_prog++;            break;  
					case 0XC9: OUT(0X0010,*p_prog),p_prog++;			break;  
					case 0XD9: BIT_SET(0X0010,*p_prog),p_prog++;	    break;  
					case 0XE9: RST(0X0010,*p_prog),p_prog++;			break;  

					case 0x2A: LD(0X0020,*p_prog),p_prog++;             break;  
					case 0x3A: LDI(0X0020,*p_prog),p_prog++;            break;  
					case 0x4A: AND(0X0020,*p_prog),p_prog++;            break;
					case 0x5A: ANI(0X0020,*p_prog),p_prog++;            break;
					case 0x6A: OR(0X0020,*p_prog),p_prog++;             break;  
					case 0x7A: ORI(0X0020,*p_prog),p_prog++;            break;  
					case 0XCA: OUT(0X0020,*p_prog),p_prog++;			break;  
					case 0XDA: BIT_SET(0X0020,*p_prog),p_prog++;	    break;  
					case 0XEA: RST(0X0020,*p_prog),p_prog++;			break;  

					case 0x2B: LD(0X0030,*p_prog),p_prog++;             break;  
					case 0x3B: LDI(0X0030,*p_prog),p_prog++;            break;  
					case 0x4B: AND(0X0030,*p_prog),p_prog++;            break;
					case 0x5B: ANI(0X0030,*p_prog),p_prog++;            break;
					case 0x6B: OR(0X0030,*p_prog),p_prog++;             break;  
					case 0x7B: ORI(0X0030,*p_prog),p_prog++;            break;  
					case 0XCB: OUT(0X0030,*p_prog),p_prog++;			break;  
					case 0XDB: BIT_SET(0X0030,*p_prog),p_prog++;	    break;  
					case 0XEB: RST(0X0030,*p_prog),p_prog++;			break;  

					case 0x2C: LD(0X0040,*p_prog),p_prog++;             break;  
					case 0x3C: LDI(0X0040,*p_prog),p_prog++;            break;  
					case 0x4C: AND(0X0040,*p_prog),p_prog++;            break;
					case 0x5C: ANI(0X0040,*p_prog),p_prog++;            break;
					case 0x6C: OR(0X0040,*p_prog),p_prog++;             break;  
					case 0x7C: ORI(0X0040,*p_prog),p_prog++;            break;  
					case 0XCC: OUT(0X0040,*p_prog),p_prog++;			break;  
					case 0XDC: BIT_SET(0X0040,*p_prog),p_prog++;	    break;  
					case 0XEC: RST(0X0040,*p_prog),p_prog++;			break;  

					case 0x2D: LD(0X0050,*p_prog),p_prog++;             break;  
					case 0x3D: LDI(0X0050,*p_prog),p_prog++;            break;  
					case 0x4D: AND(0X0050,*p_prog),p_prog++;            break;
					case 0x5D: ANI(0X0050,*p_prog),p_prog++;            break;
					case 0x6D: OR(0X0050,*p_prog),p_prog++;             break;  
					case 0x7D: ORI(0X0050,*p_prog),p_prog++;            break;  
					case 0XCD: OUT(0X0050,*p_prog),p_prog++;			break;  
					case 0XDD: BIT_SET(0X0050,*p_prog),p_prog++;	    break;  
					case 0XED: RST(0X0050,*p_prog),p_prog++;			break;  

					case 0x2E: LD(0X00F0,*p_prog),p_prog++;             break;  
					case 0x3E: LDI(0X00F0,*p_prog),p_prog++;            break;  
					case 0x4E: AND(0X00F0,*p_prog),p_prog++;            break;
					case 0x5E: ANI(0X00F0,*p_prog),p_prog++;            break;
					case 0x6E: OR(0X00F0,*p_prog),p_prog++;             break;  
					case 0x7E: ORI(0X00F0,*p_prog),p_prog++;            break;  

					case 0x2F: LD(0X00E0,*p_prog),p_prog++;             break;  
					case 0x3F: LDI(0X00E0,*p_prog),p_prog++;            break;  
					case 0x4F: AND(0X00E0,*p_prog),p_prog++;            break;
					case 0x5F: ANI(0X00E0,*p_prog),p_prog++;            break;
					case 0x6F: OR(0X00E0,*p_prog),p_prog++;             break;  
					case 0x7F: ORI(0X00E0,*p_prog),p_prog++;            break;  
					case 0XCF: OUT(0X00E0,*p_prog),p_prog++;			break;  
					case 0XDF: BIT_SET(0X00E0,*p_prog),p_prog++;	    break;  
					case 0XEF: RST(0X00E0,*p_prog),p_prog++;			break;  

					case 0XFF: other_function(*p_prog),p_prog++;	    break;  
					case 0xB0:                     p_prog++;            break;  
					case 0x00: 
								       {
									       if(((*p_prog%0x100)==0x1C)||((*p_prog%0x100)==0x0F)) 
										       goto all_end;
								       }							                    
					default:   extend_function();                       break;	
				}
			}while(1);
all_end: p_prog=p_prog;
			puls=0x01;		 
			force_reset(0X00E0,2),force_set(0X00E0,3);			
		}
		else
		{ 
			RST_Y(); 
			force_reset(0X00E0,0);	 
			force_set(0X00E0,1);	    
			all_data[0x070C]=0; 
			edit_prog=0;	  
			puls=0;
			Run=1;	  
		}
	}
	else
	{	
		RST_Y(); 
		force_reset(0X00E0,0);	 
		force_set(0X00E0,1);	    
		all_data[0x070C]=0; 
		edit_prog=0;	  
		puls=0;
		if(Run_Flag == 0)	//ADD
		{
			Run_Flag = 1;
		}		
		Run=1;
	}	
	all_data[0X701]=0X01;		
}



